{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "not_cyberbullying",
    "1": "gender",
    "2": "religion",
    "3": "other_cyberbullying",
    "4": "age",
    "5": "ethnicity"
  },
  "initializer_range": 0.02,
  "label2id": {
    "age": 4,
    "ethnicity": 5,
    "gender": 1,
    "not_cyberbullying": 0,
    "other_cyberbullying": 3,
    "religion": 2
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "output_past": true,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.0.0",
  "vocab_size": 119547
}
